Функция ПолучитьНастройкиПодсистемы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ИспользованиеСервиса", Ложь);
	СтруктураНастроек.Вставить("КлючДоступа", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	dd_НастройкиПодсистемы.ИспользованиеСервиса КАК ИспользованиеСервиса,
	|	dd_НастройкиПодсистемы.КлючДоступа КАК КлючДоступа
	|ИЗ
	|	Справочник.dd_НастройкиПодсистемы КАК dd_НастройкиПодсистемы
	|ГДЕ
	|	НЕ dd_НастройкиПодсистемы.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		СтруктураНастроек.ИспользованиеСервиса = Выборка.ИспользованиеСервиса;
		СтруктураНастроек.КлючДоступа = Выборка.КлючДоступа;
		
	КонецЕсли;
	
	Возврат СтруктураНастроек;
	
КонецФункции
