
&НаКлиенте
Процедура dd_НаименованиеОбработкаВыбораВместо(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	dd_ОбщийМодульКлиент.ОбработкаВыбора_СтрокаФИО(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ЭтаФорма, Объект, Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура dd_НаименованиеАвтоПодборВместо(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	dd_ОбщийМодульКлиент.АвтоПодбор_СтрокаФИО(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка, ЭтаФорма, Объект, Параметры);
	
КонецПроцедуры
