
&НаКлиенте
Процедура dd_ИННАвтоПодборВместо(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	dd_ОбщийМодульКлиент.АвтоПодбор_СтрокаИНН(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура dd_ИННПриИзмененииВместо(Элемент)
	
	Если НЕ Параметры.КонтрагентВыбран Тогда
		ПродолжитьВызов(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура dd_ИННОбработкаВыбораВместо(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РеквизитыКонтрагента = dd_ОбщийМодульКлиент.ПолучитьРеквизитыКонтрагента(ВыбранноеЗначение);
	
	Объект.ИНН = РеквизитыКонтрагента.ИНН;
	Объект.КПП = РеквизитыКонтрагента.КПП;
	Объект.Наименование = РеквизитыКонтрагента.Наименование;
	Объект.НаименованиеПолное = РеквизитыКонтрагента.НаименованиеПолное;
	
	ВидКонтактнойИнформацииЮрАдрес = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента");
	
	ПартнерыИКонтрагентыКлиент.ЗаполнитьЭлементКонтактнойИнформации(
	ЭтотОбъект,
	ВидКонтактнойИнформацииЮрАдрес,
	РеквизитыКонтрагента.ЮридическийАдрес);
	
	//--
	
	Отбор = Новый Структура("Вид", ВидКонтактнойИнформацииЮрАдрес);
	
	НайденныеСтроки = ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
	
	ИмяРеквизита = "";
	ИмяЭлементаДляРазмещения = "";
	ХранитьИсториюИзменений = Истина;
	
	Для каждого СтрокаКонтактнойИнформации Из НайденныеСтроки Цикл
		Если НЕ СтрокаКонтактнойИнформации.ЭтоИсторическаяКонтактнаяИнформация Тогда
			ИмяРеквизита = СтрокаКонтактнойИнформации.ИмяРеквизита;
			ИмяЭлементаДляРазмещения = СтрокаКонтактнойИнформации.ИмяЭлементаДляРазмещения;
			ХранитьИсториюИзменений = СтрокаКонтактнойИнформации.ХранитьИсториюИзменений;
		КонецЕсли;
		ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Удалить(СтрокаКонтактнойИнформации);
	КонецЦикла;
	
	ДанныеСтроки = ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Добавить();
	ДанныеСтроки.Вид = ВидКонтактнойИнформацииЮрАдрес;
	ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес");
	ДанныеСтроки.Значение = РеквизитыКонтрагента.ЮридическийАдрес.КонтактнаяИнформация;
	ДанныеСтроки.Представление = РеквизитыКонтрагента.ЮридическийАдрес.Представление;
	ДанныеСтроки.Комментарий = РеквизитыКонтрагента.ЮридическийАдрес.Комментарий;
	ДанныеСтроки.ИмяЭлементаДляРазмещения = ИмяЭлементаДляРазмещения;
	
	ДанныеСтроки.ДействуетС = Неопределено; //Дата(1970,1,1,1,0,0) + ВыбранноеЗначение.Получить("ogrn_date") / 1000;
	
	ДанныеСтроки.ИмяРеквизита = ИмяРеквизита;
	ДанныеСтроки.ЭтоИсторическаяКонтактнаяИнформация = Ложь;
	ДанныеСтроки.ХранитьИсториюИзменений = Ложь;
	
	//--
	
	Модифицированность = Истина;
	Параметры.КонтрагентВыбран = Истина;
	
КонецПроцедуры
