
&НаКлиенте
Процедура dd_ИННАвтоПодборВместо(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	dd_ОбщийМодульКлиент.АвтоПодбор_СтрокаИНН(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура dd_ИННОбработкаВыбораВместо(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РеквизитыКонтрагента = dd_ОбщийМодульКлиент.ПолучитьРеквизитыКонтрагента(ВыбранноеЗначение);
	
	ЗаполнитьРеквизитыКонтрагентаПоПолученнымДанным(РеквизитыКонтрагента);
	
КонецПроцедуры

&НаКлиенте
Процедура dd_ИННПриИзмененииВместо(Элемент)
	
	Если НЕ Параметры.КонтрагентВыбран Тогда
		ПродолжитьВызов(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура dd_ФактическийАдресОбработкаВыбораВместо(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	//Попытка
	//	УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка); 
	//Исключение
	//    //ОписаниеОшибки()
	//КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура dd_ФактическийАдресАвтоПодборВместо(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	//УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры
